```
@refer: 《像Excel一样使用python进行数据分析》
Created on 2018-08-22
```

In [27]:
import pandas as pd
import numpy as np

# 创建数据表

In [28]:
df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006],
                  "date":pd.date_range('20130102',periods = 6),
                  "city":['Beijing ','SH',' guangzhou','Shenzhen',
                         'shanghai','BEIJING '],
                  "age":[23,44,54,32,34,32],
                  "category":['100-A','100-B','110-A','110-C',
                             '210-A','130-F'],
                  "price":[1200,np.nan,2133,5433,np.nan,4432]},
                 columns=['id','date','city','category','age','price'])

In [29]:
df

     id       date        city category  age   price
0  1001 2013-01-02    Beijing     100-A   23  1200.0
1  1002 2013-01-03          SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou    110-A   54  2133.0
3  1004 2013-01-05    Shenzhen    110-C   32  5433.0
4  1005 2013-01-06    shanghai    210-A   34     NaN
5  1006 2013-01-07    BEIJING     130-F   32  4432.0

# 数据表检查

## 数据维度（行列）

In [30]:
df.shape

(6, 6)

## 数据表信息

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
id          6 non-null int64
date        6 non-null datetime64[ns]
city        6 non-null object
category    6 non-null object
age         6 non-null int64
price       4 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 368.0+ bytes

## 查看数据格式

一次性查看数据表中所有数据的格式，也可以指定一列来单独查看

In [32]:
df.dtypes

id                   int64
date        datetime64[ns]
city                object
category            object
age                  int64
price              float64
dtype: object

In [33]:
df['age'].dtypes

dtype('int64')

## 查看空值

In [34]:
df.isnull()

      id   date   city  category    age  price
0  False  False  False     False  False  False
1  False  False  False     False  False   True
2  False  False  False     False  False  False
3  False  False  False     False  False  False
4  False  False  False     False  False   True
5  False  False  False     False  False  False

In [35]:
df['price'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: price, dtype: bool

## 查看唯一值

In [36]:
df['city'].unique()

array(['Beijing ', 'SH', ' guangzhou', 'Shenzhen', 'shanghai', 'BEIJING '], dtype=object)

## 查看数据表数值

In [37]:
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'Beijing ', '100-A', 23,
        1200.0],
       [1002, Timestamp('2013-01-03 00:00:00'), 'SH', '100-B', 44, nan],
       [1003, Timestamp('2013-01-04 00:00:00'), ' guangzhou', '110-A', 54,
        2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'Shenzhen', '110-C', 32,
        5433.0],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        nan],
       [1006, Timestamp('2013-01-07 00:00:00'), 'BEIJING ', '130-F', 32,
        4432.0]], dtype=object)

## 查看列名称

In [38]:
df.columns

Index(['id', 'date', 'city', 'category', 'age', 'price'], dtype='object')

## 查看前几行数据

In [39]:
df.head(3)

     id       date        city category  age   price
0  1001 2013-01-02    Beijing     100-A   23  1200.0
1  1002 2013-01-03          SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou    110-A   54  2133.0

## 查看后几行数据

In [40]:
df.tail(3)

     id       date      city category  age   price
3  1004 2013-01-05  Shenzhen    110-C   32  5433.0
4  1005 2013-01-06  shanghai    210-A   34     NaN
5  1006 2013-01-07  BEIJING     130-F   32  4432.0

# 数据表清洗

## 处理空值（删除或填充）

In [41]:
df.dropna(how = 'any') #删除数据表中含有空值的行

     id       date        city category  age   price
0  1001 2013-01-02    Beijing     100-A   23  1200.0
2  1003 2013-01-04   guangzhou    110-A   54  2133.0
3  1004 2013-01-05    Shenzhen    110-C   32  5433.0
5  1006 2013-01-07    BEIJING     130-F   32  4432.0

In [42]:
df.fillna(value = 0)

     id       date        city category  age   price
0  1001 2013-01-02    Beijing     100-A   23  1200.0
1  1002 2013-01-03          SH    100-B   44     0.0
2  1003 2013-01-04   guangzhou    110-A   54  2133.0
3  1004 2013-01-05    Shenzhen    110-C   32  5433.0
4  1005 2013-01-06    shanghai    210-A   34     0.0
5  1006 2013-01-07    BEIJING     130-F   32  4432.0

In [49]:
df['price'].fillna(df['price'].mean(),inplace = True)

In [50]:
df

     id       date       city category  age   price
0  1001 2013-01-02    beijing    100-A   23  1200.0
1  1002 2013-01-03         sh    100-B   44  3299.5
2  1003 2013-01-04  guangzhou    110-A   54  2133.0
3  1004 2013-01-05   shenzhen    110-C   32  5433.0
4  1005 2013-01-06   shanghai    210-A   34  3299.5
5  1006 2013-01-07    beijing    130-F   32  4432.0

## 清理空格

In [51]:
df['city'] = df['city'].map(str.strip)

In [52]:
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'beijing', '100-A', 23,
        1200.0],
       [1002, Timestamp('2013-01-03 00:00:00'), 'sh', '100-B', 44, 3299.5],
       [1003, Timestamp('2013-01-04 00:00:00'), 'guangzhou', '110-A', 54,
        2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'shenzhen', '110-C', 32,
        5433.0],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        3299.5],
       [1006, Timestamp('2013-01-07 00:00:00'), 'beijing', '130-F', 32,
        4432.0]], dtype=object)

## 大小写转换

In [53]:
df['city'] = df['city'].str.lower()
df

     id       date       city category  age   price
0  1001 2013-01-02    beijing    100-A   23  1200.0
1  1002 2013-01-03         sh    100-B   44  3299.5
2  1003 2013-01-04  guangzhou    110-A   54  2133.0
3  1004 2013-01-05   shenzhen    110-C   32  5433.0
4  1005 2013-01-06   shanghai    210-A   34  3299.5
5  1006 2013-01-07    beijing    130-F   32  4432.0

## 更改数据格式

In [54]:
df['price'].astype('int')

0    1200
1    3299
2    2133
3    5433
4    3299
5    4432
Name: price, dtype: int32

In [55]:
df['price'].dtypes

dtype('float64')

## 更改列名称

In [56]:
df.rename(columns = {'category':'category-size'})

     id       date       city category-size  age   price
0  1001 2013-01-02    beijing         100-A   23  1200.0
1  1002 2013-01-03         sh         100-B   44  3299.5
2  1003 2013-01-04  guangzhou         110-A   54  2133.0
3  1004 2013-01-05   shenzhen         110-C   32  5433.0
4  1005 2013-01-06   shanghai         210-A   34  3299.5
5  1006 2013-01-07    beijing         130-F   32  4432.0

## 删除重复值

In [57]:
df['city'].drop_duplicates()

0      beijing
1           sh
2    guangzhou
3     shenzhen
4     shanghai
Name: city, dtype: object

In [59]:
df['city'].drop_duplicates(keep = 'last')

1           sh
2    guangzhou
3     shenzhen
4     shanghai
5      beijing
Name: city, dtype: object

## 数值修改及替换

In [60]:
df['city'].replace('sh','shanghai')

0      beijing
1     shanghai
2    guangzhou
3     shenzhen
4     shanghai
5      beijing
Name: city, dtype: object

# 数据预处理

## 数据表合并

In [61]:
df1 = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006,1007,1008],
                   "gender":['male','female','male','female','male',
                            'female','male','female'],
                   "pay":['Y','N','Y','Y','N','Y','N','Y'],
                   "m-point":[10,12,20,40,40,40,30,20]})

In [62]:
df1

   gender    id  m-point pay
0    male  1001       10   Y
1  female  1002       12   N
2    male  1003       20   Y
3  female  1004       40   Y
4    male  1005       40   N
5  female  1006       40   Y
6    male  1007       30   N
7  female  1008       20   Y

In [63]:
df_inner = pd.merge(df,df1,how = 'inner')

In [64]:
df_inner

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y

In [66]:
df_left = pd.merge(df,df1,how = 'left')
df_left

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y

## 设置索引列

In [67]:
df_inner.set_index('id')

           date       city category  age   price  gender  m-point pay
id
1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y
1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y

## 排序（按索引、按数值）

In [68]:
df_inner.sort_values(by = 'age')

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y

In [69]:
df_inner.sort_index()

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y

## 数据分组

In [70]:
df_inner['group'] = np.where(df_inner['price'] >3000,'high','low')

In [71]:
df_inner

     id       date       city category  age   price  gender  m-point pay group
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y   low
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N  high
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y   low
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y  high
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N  high
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y  high

In [72]:
df_inner.loc[(df_inner['city'] == 'beijing') & (df_inner['price'] >=4000),'sign'] = 1
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign
0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN
5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0

## 数据分列

In [74]:
split = pd.DataFrame((x.split('-') for x in df_inner['category']),index = df_inner.index,columns = ['category','size'])
split

  category size
0      100    A
1      100    B
2      110    A
3      110    C
4      210    A
5      130    F

In [75]:
df_inner = pd.merge(df_inner,split,right_index = True,left_index = True)

In [76]:
df_inner

,id,date,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

# 数据提取

## 按标签提取

In [78]:
df_inner.loc[3]

id                           1004
date          2013-01-05 00:00:00
city                     shenzhen
category_x                  110-C
age                            32
price                        5433
gender                     female
m-point                        40
pay                             Y
group                        high
sign                          NaN
category_y                    110
size                            C
Name: 3, dtype: object

In [79]:
df_inner.loc[0:5]

,id,date,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [80]:
df_inner.reset_index()

,index,id,date,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
0,0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [81]:
df_inner = df_inner.set_index('date')

In [82]:
df_inner

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-03,1002,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2013-01-04,1003,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
2013-01-05,1004,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [83]:
df_inner[:'2013-01-04']

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-03,1002,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2013-01-04,1003,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A

## 按位置提取

In [84]:
df_inner.iloc[:3,:2]

              id       city
date
2013-01-02  1001    beijing
2013-01-03  1002         sh
2013-01-04  1003  guangzhou

In [85]:
df_inner.iloc[[0,2,5],[4,5]]    #0,2,5表示数据所在行的位置

             price  gender
date
2013-01-02  1200.0    male
2013-01-04  2133.0    male
2013-01-07  4432.0  female

## 按标签和位置提取

In [90]:
df_inner.ix[:'2013-01-03',:4]

              id     city category_x  age
date
2013-01-02  1001  beijing      100-A   23
2013-01-03  1002       sh      100-B   44

## 按条件提取（区域和条件值）

In [91]:
df_inner['city'].isin(['beijing'])

date
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
2013-01-07     True
Name: city, dtype: bool

In [92]:
df_inner.loc[df_inner['city'].isin(['beijing','shanghai'])]

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [97]:
category = df_inner['category_x']
pd.DataFrame(category.str[:3])

           category_x
date
2013-01-02        100
2013-01-03        100
2013-01-04        110
2013-01-05        110
2013-01-06        210
2013-01-07        130

# 数据筛选

## 按条件筛选

### 与

In [98]:
df_inner.loc[(df_inner['age']>25) & (df_inner['city']== 'beijing'),['id','city','age','category','gender']]

              id     city  age  category  gender
date
2013-01-07  1006  beijing   32       NaN  female

### 或

In [100]:
df_inner.loc[(df_inner['age']>25) | (df_inner['city'] == 'beijing'),['id','city','age','category','gender']].sort_values(['age'])

              id       city  age  category  gender
date
2013-01-02  1001    beijing   23       NaN    male
2013-01-05  1004   shenzhen   32       NaN  female
2013-01-07  1006    beijing   32       NaN  female
2013-01-06  1005   shanghai   34       NaN    male
2013-01-03  1002         sh   44       NaN  female
2013-01-04  1003  guangzhou   54       NaN    male

In [102]:
df_inner.loc[(df_inner['age']>25) | (df_inner['city'] == 'beijing'),['id','city','age','category','gender','price']].sort_values(['age']).price.sum()

19797.0

### 非

In [104]:
df_inner.loc[(df_inner['city'] != 'beijing'),['id','city','age','category','gender']].sort_values('id')

              id       city  age  category  gender
date
2013-01-03  1002         sh   44       NaN  female
2013-01-04  1003  guangzhou   54       NaN    male
2013-01-05  1004   shenzhen   32       NaN  female
2013-01-06  1005   shanghai   34       NaN    male

In [105]:
df_inner.loc[(df_inner['city'] != 'beijing'),['id','city','age','category','gender']].sort_values('id').city.count()

4

### query函数进行筛选

In [107]:
df_inner.query('city ==["beijing","shanghai"]')

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [108]:
df_inner.query('city ==["beijing","shanghai"]').price.sum()

8931.5

# 数据汇总

## groupby

In [109]:
df_inner.groupby('city').count()

,id,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
city,,,,,,,,,,,
beijing,2,2,2,2,2,2,2,2,1,2,2
guangzhou,1,1,1,1,1,1,1,1,0,1,1
sh,1,1,1,1,1,1,1,1,0,1,1
shanghai,1,1,1,1,1,1,1,1,0,1,1
shenzhen,1,1,1,1,1,1,1,1,0,1,1

In [110]:
df_inner.groupby('city')['id'].count()

city
beijing      2
guangzhou    1
sh           1
shanghai     1
shenzhen     1
Name: id, dtype: int64

In [111]:
df_inner.groupby(['city','size'])['id'].count()

city       size
beijing    A       1
           F       1
guangzhou  A       1
sh         B       1
shanghai   A       1
shenzhen   C       1
Name: id, dtype: int64

In [113]:
df_inner.groupby('city')['price'].agg([len,np.sum,np.mean])

           len     sum    mean
city
beijing    2.0  5632.0  2816.0
guangzhou  1.0  2133.0  2133.0
sh         1.0  3299.5  3299.5
shanghai   1.0  3299.5  3299.5
shenzhen   1.0  5433.0  5433.0

## 数据透视

In [114]:
pd.pivot_table(df_inner,index = ['city'],values = ['price'],columns = ['size'],aggfunc = [len,np.sum],fill_value = 0,margins = True)

            len                         sum
          price                       price
size          A    B    C    F  All       A       B       C       F      All
city
beijing     1.0  0.0  0.0  1.0  2.0  1200.0     0.0     0.0  4432.0   5632.0
guangzhou   1.0  0.0  0.0  0.0  1.0  2133.0     0.0     0.0     0.0   2133.0
sh          0.0  1.0  0.0  0.0  1.0     0.0  3299.5     0.0     0.0   3299.5
shanghai    1.0  0.0  0.0  0.0  1.0  3299.5     0.0     0.0     0.0   3299.5
shenzhen    0.0  0.0  1.0  0.0  1.0     0.0     0.0  5433.0     0.0   5433.0
All         3.0  1.0  1.0  1.0  6.0  6632.5  3299.5  5433.0  4432.0  19797.0

# 数据统计

## 数据采样

In [115]:
df_inner.sample(n = 3)

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F
2013-01-03,1002,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A

### weights

Weights参数是采样的权重，通过设置不同的权重可以更改采样的结果，权重高的数据将更有希望被选中

In [116]:
weights = [0,0,0,0,0.5,0.5]

In [117]:
df_inner.sample(n = 2,weights = weights)

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A

### replace

Sample函数中还有一个参数replace,用来设置采样后是否放回

In [118]:
df_inner.sample(n = 6,replace = False)   #采样以后不放回

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-05,1004,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-04,1003,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
2013-01-03,1002,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B

In [119]:
df_inner.sample(n = 6,replace = True)  #采样后放回

,id,city,category_x,age,price,gender,m-point,pay,group,sign,category_y,size
date,,,,,,,,,,,,
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A

## 描述统计

In [120]:
df_inner.describe().round(2).T

         count    mean      std     min      25%     50%      75%     max
id         6.0  1003.5     1.87  1001.0  1002.25  1003.5  1004.75  1006.0
age        6.0    36.5    10.88    23.0    32.00    33.0    41.50    54.0
price      6.0  3299.5  1523.35  1200.0  2424.62  3299.5  4148.88  5433.0
m-point    6.0    27.0    14.63    10.0    14.00    30.0    40.00    40.0
sign       1.0     1.0      NaN     1.0     1.00     1.0     1.00     1.0

## 标准差

In [121]:
df_inner['price'].std()

1523.3516337339847

## 协方差

In [123]:
df_inner['price'].cov(df_inner['m-point'])  #两个字段间的协方差

17263.0

In [124]:
df_inner.cov()    #所有字段间的协方差

             id     age      price  m-point  sign
id          3.5    -0.7     1946.0     25.4   NaN
age        -0.7   118.3    -1353.5    -31.0   NaN
price    1946.0 -1353.5  2320600.2  17263.0   NaN
m-point    25.4   -31.0    17263.0    214.0   NaN
sign        NaN     NaN        NaN      NaN   NaN

## 相关分析

In [125]:
df_inner['price'].corr(df_inner['m-point'])

0.7746565925361043

In [126]:
df_inner.corr()

               id       age     price   m-point  sign
id       1.000000 -0.034401  0.682824  0.928096   NaN
age     -0.034401  1.000000 -0.081689 -0.194833   NaN
price    0.682824 -0.081689  1.000000  0.774657   NaN
m-point  0.928096 -0.194833  0.774657  1.000000   NaN
sign          NaN       NaN       NaN       NaN   NaN

# 数据输出

## 写入excel

In [ ]:
df_inner.to_excel('Excel_to_Python.xlsx',sheet_name = 'bluewhale_cc')

## 写入csv

In [ ]:
df_inner.to_csv('Excel_to_Python.csv')

# 案例分析：990万次骑行：纽约自行车共享系统分析

[蓝鲸的网站分析笔记](http://bluewhale.cc/2016-10-18/9-9-million-riding-new-york-bike-sharing-system-analysis.html)

[数据来源](https://s3.amazonaws.com/tripdata/index.html)